bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA64HVE2.xml
<?xml version="1.0" encoding="UTF-8"?>
<target-description-file>
    <variants>
        <variant tempmin="0" tempmax="0" speedmax="0" package="" ordercode="standard" vccmin="3.0" vccmax="3.6"/>
    </variants>
    <devices>
        <device name="ATmega64HVE2" architecture="AVR8" family="megaAVR">
            <address-spaces>
                <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x10000">
                    <memory-segment start="0x0000" size="0x10000" type="flash" rw="RW" exec="1" name="FLASH"
                                    pagesize="0x80"/>
                    <memory-segment start="0xfc00" size="0x0400" type="flash" rw="RW" exec="1" name="BOOT_SECTION_1"
                                    pagesize="0x80"/>
                    <memory-segment start="0xf800" size="0x0800" type="flash" rw="RW" exec="1" name="BOOT_SECTION_2"
                                    pagesize="0x80"/>
                    <memory-segment start="0xf000" size="0x1000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_3"
                                    pagesize="0x80"/>
                    <memory-segment start="0xe000" size="0x2000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_4"
                                    pagesize="0x80"/>
                </address-space>
                <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
                    <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
                </address-space>
                <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0002">
                    <memory-segment start="0" size="0x0002" type="fuses" rw="RW" exec="0" name="FUSES"/>
                </address-space>
                <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
                    <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
                </address-space>
                <address-space endianness="little" name="data" id="data" start="0x0000" size="0x1100">
                    <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
                    <memory-segment name="MAPPED_IO" start="0x0020" size="0x00e0" type="io" external="false"/>
                    <memory-segment name="IRAM" start="0x0100" size="0x1000" type="ram" external="false"/>
                </address-space>
                <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0400">
                    <memory-segment start="0x0000" size="0x0400" type="eeprom" rw="RW" exec="0" name="EEPROM"
                                    pagesize="0x04"/>
                </address-space>
                <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
            </address-spaces>
            <peripherals>
                <module name="SPI">
                    <instance name="SPI" caption="Serial Peripheral Interface">
                        <register-group name="SPI" name-in-module="SPI" offset="0x00" address-space="data"
                                        caption="Serial Peripheral Interface"/>
                    </instance>
                </module>
                <module name="EEPROM">
                    <instance name="EEPROM" caption="EEPROM">
                        <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data"
                                        caption="EEPROM"/>
                    </instance>
                </module>
                <module name="TC16">
                    <instance name="TC1" caption="Timer/Counter, 16-bit">
                        <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 16-bit"/>
                    </instance>
                    <instance name="TC0" caption="Timer/Counter, 16-bit">
                        <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 16-bit"/>
                    </instance>
                </module>
                <module name="PORT">
                    <instance name="PORTB" caption="I/O Port">
                        <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                    <instance name="PORTA" caption="I/O Port">
                        <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                </module>
                <module name="BOOT_LOAD">
                    <instance name="BOOT_LOAD" caption="Bootloader">
                        <register-group name="BOOT_LOAD" name-in-module="BOOT_LOAD" offset="0x00" address-space="data"
                                        caption="Bootloader"/>
                    </instance>
                </module>
                <module name="ADC">
                    <instance name="ADC" caption="Analog-to-Digital Converter">
                        <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data"
                                        caption="Analog-to-Digital Converter"/>
                    </instance>
                </module>
                <module name="BANDGAP">
                    <instance name="BANDGAP" caption="Bandgap">
                        <register-group name="BANDGAP" name-in-module="BANDGAP" offset="0x00" address-space="data"
                                        caption="Bandgap"/>
                    </instance>
                </module>
                <module name="LINUART">
                    <instance name="LINUART" caption="Local Interconnect Network">
                        <register-group name="LINUART" name-in-module="LINUART" offset="0x00" address-space="data"
                                        caption="Local Interconnect Network"/>
                    </instance>
                </module>
