bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA64HVE2.xml
                <module name="CPU">
                    <instance name="CPU" caption="CPU Registers">
                        <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data"
                                        caption="CPU Registers"/>
                        <parameters>
                            <param name="CORE_VERSION" value="V2E"/>
                        </parameters>
                    </instance>
                </module>
                <module name="EXINT">
                    <instance name="EXINT" caption="External Interrupts">
                        <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data"
                                        caption="External Interrupts"/>
                    </instance>
                </module>
                <module name="WDT">
                    <instance name="WDT" caption="Watchdog Timer">
                        <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data"
                                        caption="Watchdog Timer"/>
                    </instance>
                </module>
                <module name="WAKEUP_TIMER">
                    <instance name="WAKEUP_TIMER" caption="Wakeup Timer">
                        <register-group name="WAKEUP_TIMER" name-in-module="WAKEUP_TIMER" offset="0x00"
                                        address-space="data" caption="Wakeup Timer"/>
                    </instance>
                </module>
                <module name="FUSE">
                    <instance name="FUSE" caption="Fuses">
                        <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses"
                                        caption="Fuses"/>
                    </instance>
                </module>
                <module name="LOCKBIT">
                    <instance name="LOCKBIT" caption="Lockbits">
                        <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits"
                                        caption="Lockbits"/>
                    </instance>
                </module>
            </peripherals>


            <interrupts>
                <interrupt index="0" name="RESET"
                           caption="External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset"/>
                <interrupt index="1" name="INT0" caption="External Interrupt 0"/>
                <interrupt index="2" name="PCINT0" caption="Pin Change Interrupt 0"/>
                <interrupt index="3" name="PCINT1" caption="Pin Change Interrupt 1"/>
                <interrupt index="4" name="WDT" caption="Watchdog Timeout Interrupt"/>
                <interrupt index="5" name="WAKEUP" caption="Wakeup Timer Overflow"/>
                <interrupt index="6" name="TIMER1_IC" caption="Timer 1 Input capture"/>
                <interrupt index="7" name="TIMER1_COMPA" caption="Timer 1 Compare Match A"/>
                <interrupt index="8" name="TIMER1_COMPB" caption="Timer 1 Compare Match B"/>
                <interrupt index="9" name="TIMER1_OVF" caption="Timer 1 overflow"/>
                <interrupt index="10" name="TIMER0_IC" caption="Timer 0 Input Capture"/>
                <interrupt index="11" name="TIMER0_COMPA" caption="Timer 0 Comapre Match A"/>
                <interrupt index="12" name="TIMER0_COMPB" caption="Timer 0 Compare Match B"/>
                <interrupt index="13" name="TIMER0_OVF" caption="Timer 0 Overflow"/>
                <interrupt index="14" name="LIN_STATUS" caption="LIN Status Interrupt"/>
                <interrupt index="15" name="LIN_ERROR" caption="LIN Error Interrupt"/>
                <interrupt index="16" name="SPI_STC" caption="SPI Serial transfer complete"/>
                <interrupt index="17" name="VADC_CONV" caption="Voltage ADC Instantaneous Conversion Complete"/>
                <interrupt index="18" name="VADC_ACC" caption="Voltage ADC Accumulated Conversion Complete"/>
                <interrupt index="19" name="CADC_CONV" caption="C-ADC Instantaneous Conversion Complete"/>
                <interrupt index="20" name="CADC_REG_CUR" caption="C-ADC Regular Current"/>
                <interrupt index="21" name="CADC_ACC" caption="C-ADC Accumulated Conversion Complete"/>
                <interrupt index="22" name="EE_READY" caption="EEPROM Ready"/>
                <interrupt index="23" name="SPM" caption="SPM Ready"/>
                <interrupt index="24" name="PLL" caption="PLL Lock Change Interrupt"/>
            </interrupts>
            <interfaces>
                <interface name="ISP" type="isp"/>
                <interface name="HVSP" type="hvsp"/>
                <interface name="debugWIRE" type="dw"/>
            </interfaces>
            <property-groups>
                <property-group name="SIGNATURES">
                    <property name="JTAGID" value="0x9610"/>
                    <property name="SIGNATURE0" value="0x1e"/>
                    <property name="SIGNATURE1" value="0x96"/>
                    <property name="SIGNATURE2" value="0x10"/>
                </property-group>
                <property-group name="OCD">
                    <property name="OCD_REVISION" value="1"/>
                    <property name="OCD_DATAREG" value="0x31"/>
                    <property name="PROGBASE" value="0x0000"/>
                </property-group>
                <property-group name="JTAG_INTERFACE">
                    <property name="ALLOWFULLPAGESTREAM" value="0x00"/>
                </property-group>
                <property-group name="ISP_INTERFACE_STK600">
                    <property name="IspEnterProgMode_timeout" value="200"/>
                    <property name="IspEnterProgMode_stabDelay" value="100"/>
                    <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
                    <property name="IspEnterProgMode_synchLoops" value="32"/>
                    <property name="IspEnterProgMode_byteDelay" value="0"/>
                    <property name="IspEnterProgMode_pollIndex" value="3"/>
                    <property name="IspEnterProgMode_pollValue" value="0x53"/>
                    <property name="IspLeaveProgMode_preDelay" value="1"/>
                    <property name="IspLeaveProgMode_postDelay" value="1"/>
                    <property name="IspChipErase_eraseDelay" value="10"/>
                    <property name="IspChipErase_pollMethod" value="0"/>
                    <property name="IspProgramFlash_mode" value="0x21"/>
                    <property name="IspProgramFlash_blockSize" value="128"/>
                    <property name="IspProgramFlash_delay" value="6"/>
                    <property name="IspProgramFlash_cmd1" value="0x40"/>
                    <property name="IspProgramFlash_cmd2" value="0x4C"/>
                    <property name="IspProgramFlash_cmd3" value="0x20"/>
                    <property name="IspProgramFlash_pollVal1" value="0xFF"/>
                    <property name="IspProgramFlash_pollVal2" value="0x00"/>
                    <property name="IspProgramEeprom_mode" value="0x04"/>
                    <property name="IspProgramEeprom_blockSize" value="64"/>
                    <property name="IspProgramEeprom_delay" value="20"/>
                    <property name="IspProgramEeprom_cmd1" value="0xC0"/>
                    <property name="IspProgramEeprom_cmd2" value="0x00"/>
                    <property name="IspProgramEeprom_cmd3" value="0xA0"/>
                    <property name="IspProgramEeprom_pollVal1" value="0xFF"/>
                    <property name="IspProgramEeprom_pollVal2" value="0xFF"/>
                    <property name="IspReadFlash_blockSize" value="256"/>
                    <property name="IspReadEeprom_blockSize" value="256"/>
                    <property name="IspReadFuse_pollIndex" value="4"/>
                    <property name="IspReadLock_pollIndex" value="4"/>
                    <property name="IspReadSign_pollIndex" value="4"/>
                    <property name="IspReadOsccal_pollIndex" value="4"/>
                </property-group>
                <property-group name="HVSP_INTERFACE_STK600">
                    <property name="HvspControlStack"
                              value="0x4C 0x0C 0x1C 0x2C 0x3C 0x64 0x74 0x66 0x68 0x78 0x68 0x68 0x7A 0x6A 0x68 0x78 0x78 0x7D 0x6D 0x0C 0x80 0x40 0x20 0x10 0x11 0x08 0x04 0x02 0x03 0x08 0x04 0x0F"/>
                    <property name="HvspEnterProgMode_stabDelay" value="100"/>
                    <property name="HvspEnterProgMode_cmdexeDelay" value="0"/>
                    <property name="HvspEnterProgMode_synchCycles" value="6"/>
                    <property name="HvspEnterProgMode_latchCycles" value="1"/>
                    <property name="HvspEnterProgMode_toggleVtg" value="1"/>
                    <property name="HvspEnterProgMode_powoffDelay" value="20"/>
                    <property name="HvspEnterProgMode_resetDelay1" value="1"/>
                    <property name="HvspEnterProgMode_resetDelay2" value="70"/>
                    <property name="HvspLeaveProgMode_stabDelay" value="101"/>
                    <property name="HvspLeaveProgMode_resetDelay" value="26"/>
                    <property name="HvspChipErase_pollTimeout" value="40"/>
                    <property name="HvspChipErase_eraseTime" value="1"/>
                    <property name="HvspProgramFlash_mode" value="0x0D"/>
                    <property name="HvspProgramFlash_blockSize" value="256"/>
                    <property name="HvspProgramFlash_pollTimeout" value="6"/>
                    <property name="HvspReadFlash_blockSize" value="256"/>
                    <property name="HvspProgramEeprom_mode" value="0x05"/>
                    <property name="HvspProgramEeprom_blockSize" value="256"/>
                    <property name="HvspProgramEeprom_pollTimeout" value="5"/>
                    <property name="HvspReadEeprom_blockSize" value="256"/>
                    <property name="HvspProgramFuse_pollTimeout" value="25"/>
                    <property name="HvspProgramLock_pollTimeout" value="25"/>
                </property-group>
                <property-group name="ISP_INTERFACE">
                    <property name="IspEnterProgMode_timeout" value="200"/>
                    <property name="IspEnterProgMode_stabDelay" value="100"/>
                    <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
                    <property name="IspEnterProgMode_synchLoops" value="32"/>
                    <property name="IspEnterProgMode_byteDelay" value="0"/>
                    <property name="IspEnterProgMode_pollIndex" value="3"/>
                    <property name="IspEnterProgMode_pollValue" value="0x53"/>
                    <property name="IspLeaveProgMode_preDelay" value="1"/>
                    <property name="IspLeaveProgMode_postDelay" value="1"/>
                    <property name="IspChipErase_eraseDelay" value="20"/>
                    <property name="IspChipErase_pollMethod" value="1"/>
                    <property name="IspProgramFlash_mode" value="0x41"/>
                    <property name="IspProgramFlash_blockSize" value="128"/>
                    <property name="IspProgramFlash_delay" value="10"/>
                    <property name="IspProgramFlash_cmd1" value="0x40"/>
                    <property name="IspProgramFlash_cmd2" value="0x4C"/>
                    <property name="IspProgramFlash_cmd3" value="0x00"/>
                    <property name="IspProgramFlash_pollVal1" value="0x00"/>
                    <property name="IspProgramFlash_pollVal2" value="0x00"/>
                    <property name="IspProgramEeprom_mode" value="0x41"/>
                    <property name="IspProgramEeprom_blockSize" value="4"/>
                    <property name="IspProgramEeprom_delay" value="20"/>
                    <property name="IspProgramEeprom_cmd1" value="0xC1"/>
                    <property name="IspProgramEeprom_cmd2" value="0xC2"/>
                    <property name="IspProgramEeprom_cmd3" value="0x00"/>
                    <property name="IspProgramEeprom_pollVal1" value="0x00"/>
                    <property name="IspProgramEeprom_pollVal2" value="0x00"/>
                    <property name="IspReadFlash_blockSize" value="256"/>
                    <property name="IspReadEeprom_blockSize" value="256"/>
                    <property name="IspReadFuse_pollIndex" value="4"/>
                    <property name="IspReadLock_pollIndex" value="4"/>
                    <property name="IspReadSign_pollIndex" value="4"/>
                    <property name="IspReadOsccal_pollIndex" value="4"/>
                </property-group>
                <property-group name="HVSP_INTERFACE">
                    <property name="HvspControlStack"
                              value="0x4C 0x0C 0x1C 0x2C 0x3C 0x64 0x74 0x66 0x68 0x78 0x68 0x68 0x7A 0x6A 0x68 0x78 0x78 0x7D 0x6D 0x0C 0x80 0x40 0x20 0x10 0x11 0x08 0x04 0x02 0x03 0x08 0x04 0x0F"/>
                    <property name="HvspEnterProgMode_stabDelay" value="100"/>
                    <property name="HvspEnterProgMode_cmdexeDelay" value="0"/>
                    <property name="HvspEnterProgMode_synchCycles" value="6"/>
                    <property name="HvspEnterProgMode_latchCycles" value="1"/>
                    <property name="HvspEnterProgMode_toggleVtg" value="1"/>
                    <property name="HvspEnterProgMode_powoffDelay" value="25"/>
                    <property name="HvspEnterProgMode_resetDelay1" value="1"/>
                    <property name="HvspEnterProgMode_resetDelay2" value="70"/>
                    <property name="HvspLeaveProgMode_stabDelay" value="101"/>
                    <property name="HvspLeaveProgMode_resetDelay" value="26"/>
                    <property name="HvspChipErase_pollTimeout" value="40"/>
                    <property name="HvspChipErase_eraseTime" value="1"/>
                    <property name="HvspProgramFlash_mode" value="0x0D"/>
                    <property name="HvspProgramFlash_blockSize" value="256"/>
                    <property name="HvspProgramFlash_pollTimeout" value="6"/>
                    <property name="HvspReadFlash_blockSize" value="256"/>
                    <property name="HvspProgramEeprom_mode" value="0x05"/>
                    <property name="HvspProgramEeprom_blockSize" value="256"/>
                    <property name="HvspProgramEeprom_pollTimeout" value="5"/>
                    <property name="HvspReadEeprom_blockSize" value="256"/>
                    <property name="HvspProgramFuse_pollTimeout" value="25"/>
                    <property name="HvspProgramLock_pollTimeout" value="25"/>
                </property-group>
            </property-groups>
        </device>
    </devices>
    <modules>
        <module caption="Fuses" name="FUSE">
            <register-group caption="Fuses" name="FUSE">
                <register caption="" name="LOW" offset="0x00" size="1" initval="0xD7">
                    <bitfield caption="Watch-dog Timer always on" mask="0x80" name="WDTON"/>
                    <bitfield caption="Preserve EEPROM through the Chip Erase cycle" mask="0x40" name="EESAVE"/>
                    <bitfield caption="Serial program downloading (SPI) enabled" mask="0x20" name="SPIEN"/>
                    <bitfield caption="Brown-out detection enabled" mask="0x10" name="BODEN"/>
                    <bitfield caption="Divide clock by 8" mask="0x08" name="CKDIV8"/>
                    <bitfield caption="Select start-up time" mask="0x6" name="SUT" values="ENUM_SUT"/>
                    <bitfield caption="Oscillator select" mask="0x01" name="OSCSEL0"/>
                </register>
                <register caption="" name="HIGH" offset="0x01" size="1" initval="0xF9">
                    <bitfield caption="Debug Wire enable" mask="0x08" name="DWEN"/>
                    <bitfield caption="Select Boot Size" mask="0x06" name="BOOTSZ" values="ENUM_BOOTSZ"/>
                    <bitfield caption="Boot Reset vector Enabled" mask="0x01" name="BOOTRST"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_SUT">
                <value caption="Start-up time 14 CK + 0 ms" name="14CK_0MS" value="0x00"/>
                <value caption="Start-up time 14 CK + 16 ms" name="14CK_16MS" value="0x01"/>
                <value caption="Start-up time 14 CK + 32 ms" name="14CK_32MS" value="0x02"/>
                <value caption="Start-up time 14 CK + 64 ms" name="14CK_64MS" value="0x03"/>
            </value-group>
