bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA64HVE2.xml
            <value-group caption="" name="ENUM_BOOTSZ">
                <value caption="Boot Flash size=512 words Boot address=$7E00" name="512W_7E00" value="0x03"/>
                <value caption="Boot Flash size=1024 words Boot address=$7C00" name="1024W_7C00" value="0x02"/>
                <value caption="Boot Flash size=2048 words Boot address=$7800" name="2048W_7800" value="0x01"/>
                <value caption="Boot Flash size=4096 words Boot address=$7000" name="4096W_7000" value="0x00"/>
            </value-group>
        </module>
        <module caption="Lockbits" name="LOCKBIT">
            <register-group caption="Lockbits" name="LOCKBIT">
                <register caption="" name="LOCKBIT" offset="0x00" size="1" initval="0xFF">
                    <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
                    <bitfield caption="Boot Loader Protection Mode" mask="0x0C" name="BLB0" values="ENUM_BLB"/>
                    <bitfield caption="Boot Loader Protection Mode" mask="0x30" name="BLB1" values="ENUM_BLB2"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_LB">
                <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
                <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
                <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
            </value-group>
            <value-group caption="" name="ENUM_BLB">
                <value caption="LPM and SPM prohibited in Application Section" name="LPM_SPM_DISABLE" value="0x00"/>
                <value caption="LPM prohibited in Application Section" name="LPM_DISABLE" value="0x01"/>
                <value caption="SPM prohibited in Application Section" name="SPM_DISABLE" value="0x02"/>
                <value caption="No lock on SPM and LPM in Application Section" name="NO_LOCK" value="0x03"/>
            </value-group>
            <value-group caption="" name="ENUM_BLB2">
                <value caption="LPM and SPM prohibited in Boot Section" name="LPM_SPM_DISABLE" value="0x00"/>
                <value caption="LPM prohibited in Boot Section" name="LPM_DISABLE" value="0x01"/>
                <value caption="SPM prohibited in Boot Section" name="SPM_DISABLE" value="0x02"/>
                <value caption="No lock on SPM and LPM in Boot Section" name="NO_LOCK" value="0x03"/>
            </value-group>
        </module>
        <module caption="Serial Peripheral Interface" name="SPI">
            <register-group caption="Serial Peripheral Interface" name="SPI">
                <register caption="SPI Control Register" name="SPCR" offset="0x4c" size="1">
                    <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
                    <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
                    <bitfield caption="Data Order" mask="0x20" name="DORD"/>
                    <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
                    <bitfield caption="Clock polarity" mask="0x08" name="CPOL"/>
                    <bitfield caption="Clock Phase" mask="0x04" name="CPHA"/>
                    <bitfield caption="SPI Clock Rate Selects" mask="0x03" name="SPR" values="COMM_SCK_RATE_3BIT"/>
                </register>
                <register caption="SPI Status Register" name="SPSR" offset="0x4d" size="1" ocd-rw="R">
                    <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF"/>
                    <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL"/>
                    <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X"/>
                </register>
                <register caption="SPI Data Register" name="SPDR" offset="0x4e" size="1" mask="0xFF" ocd-rw=""/>
            </register-group>
            <value-group caption="" name="COMM_SCK_RATE_3BIT">
                <value caption="fosc/4" name="VAL_0x00" value="0x00"/>
                <value caption="fosc/16" name="VAL_0x01" value="0x01"/>
                <value caption="fosc/64" name="VAL_0x02" value="0x02"/>
                <value caption="fosc/128" name="VAL_0x03" value="0x03"/>
                <value caption="fosc/2" name="VAL_0x04" value="0x04"/>
                <value caption="fosc/8" name="VAL_0x05" value="0x05"/>
                <value caption="fosc/32" name="VAL_0x06" value="0x06"/>
                <value caption="fosc/64" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="EEPROM" name="EEPROM">
            <register-group caption="EEPROM" name="EEPROM">
                <register caption="EEPROM Read/Write Access" name="EEAR" offset="0x41" size="2" mask="0x03FF"/>
                <register caption="EEPROM Data Register" name="EEDR" offset="0x40" size="1" mask="0xFF"/>
                <register caption="EEPROM Control Register" name="EECR" offset="0x3F" size="1">
                    <bitfield caption="" mask="0x30" name="EEPM" values="EEP_MODE"/>
                    <bitfield caption="EEProm Ready Interrupt Enable" mask="0x08" name="EERIE"/>
                    <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMPE"/>
                    <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEPE"/>
                    <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
                </register>
            </register-group>
            <value-group caption="" name="EEP_MODE">
                <value caption="Erase and Write in one operation" name="VAL_0x00" value="0x00"/>
                <value caption="Erase Only" name="VAL_0x01" value="0x01"/>
                <value caption="Write Only" name="VAL_0x02" value="0x02"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 16-bit" name="TC16">
            <register-group caption="Timer/Counter, 16-bit" name="TC1">
                <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x81" size="1">
                    <bitfield caption="Clock Select1 bis" mask="0x07" name="CS" values="CLK_SEL_3BIT_EXT" lsb="10"/>
                </register>
