bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA64HVE2.xml
        <module caption="Watchdog Timer" name="WDT">
            <register-group caption="Watchdog Timer" name="WDT">
                <register caption="Watchdog Timer Control Register" name="WDTCSR" offset="0x60" size="1" ocd-rw="R">
                    <bitfield caption="Watchdog Timeout Interrupt Flag" mask="0x80" name="WDIF"/>
                    <bitfield caption="Watchdog Timeout Interrupt Enable" mask="0x40" name="WDIE"/>
                    <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP"
                              values="WDOG_TIMER_PRESCALE_4BITS"/>
                    <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
                    <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
                </register>
                <register caption="Watchdog Timer Configuration Lock Register" name="WDTCLR" offset="0x63" size="1">
                    <bitfield caption="Watchdog Timer Comfiguration Lock bits" mask="0x06" name="WDCL"/>
                    <bitfield caption="Watchdog Timer Comfiguration Lock Enable" mask="0x01" name="WDCLE"/>
                </register>
            </register-group>
            <value-group caption="" name="WDOG_TIMER_PRESCALE_4BITS">
                <value caption="Oscillator Cycles 2K" name="VAL_0x00" value="0x00"/>
                <value caption="Oscillator Cycles 4K" name="VAL_0x01" value="0x01"/>
                <value caption="Oscillator Cycles 8K" name="VAL_0x02" value="0x02"/>
                <value caption="Oscillator Cycles 16K" name="VAL_0x03" value="0x03"/>
                <value caption="Oscillator Cycles 32K" name="VAL_0x04" value="0x04"/>
                <value caption="Oscillator Cycles 64K" name="VAL_0x05" value="0x05"/>
                <value caption="Oscillator Cycles 128K" name="VAL_0x06" value="0x06"/>
                <value caption="Oscillator Cycles 256K" name="VAL_0x07" value="0x07"/>
                <value caption="Oscillator Cycles 512K" name="VAL_0x08" value="0x08"/>
                <value caption="Oscillator Cycles 1024K" name="VAL_0x09" value="0x09"/>
            </value-group>
        </module>
        <module caption="Wakeup Timer" name="WAKEUP_TIMER">
            <register-group caption="Wakeup Timer" name="WAKEUP_TIMER">
                <register caption="Wake-up Timer Control and Status Register" name="WUTCSR" offset="0x62" size="1"
                          ocd-rw="R">
                    <bitfield caption="Wake-up Timer Interrupt Flag" mask="0x80" name="WUTIF"/>
                    <bitfield caption="Wake-up Timer Interrupt Enable" mask="0x40" name="WUTIE"/>
                    <bitfield caption="Wake-up Timer Reset" mask="0x10" name="WUTR"/>
                    <bitfield caption="Wake-up Timer Enable" mask="0x08" name="WUTE"/>
                    <bitfield caption="Wake-up Timer Prescaler Bits" mask="0x07" name="WUTP"/>
                </register>
            </register-group>
        </module>
    </modules>
</target-description-file>
